/* automatically generated by rust-bindgen 0.70.1 */

// SPDX-License-Identifier: EUPL-1.2 OR GPL-3.0-or-later

pub type size_t = ::core::ffi::c_uint;
pub type __int64_t = ::core::ffi::c_longlong;
pub type __off_t = ::core::ffi::c_long;
pub type __off64_t = __int64_t;
pub type __time_t = ::core::ffi::c_long;
pub type __ssize_t = ::core::ffi::c_int;
pub type off_t = __off64_t;
pub type ssize_t = __ssize_t;
pub type time_t = __time_t;
pub type gpg_error_t = ::core::ffi::c_uint;
pub type gpgrt_stream_t = *mut _gpgrt__stream;
pub type gpgme_off_t = off_t;
pub type gpgme_ssize_t = ssize_t;
pub type gpgme_ctx_t = *mut gpgme_context;
pub type gpgme_data_t = *mut gpgme_data;
pub type gpgme_error_t = gpg_error_t;
pub type gpgme_keylist_mode_t = ::core::ffi::c_uint;
pub type gpgme_export_mode_t = ::core::ffi::c_uint;
pub type gpgme_sig_notation_flags_t = ::core::ffi::c_uint;
pub type gpgme_sig_notation_t = *mut _gpgme_sig_notation;
pub type gpgme_engine_info_t = *mut _gpgme_engine_info;
pub type gpgme_tofu_info_t = *mut _gpgme_tofu_info;
pub type gpgme_subkey_t = *mut _gpgme_subkey;
pub type gpgme_key_sig_t = *mut _gpgme_key_sig;
pub type gpgme_user_id_t = *mut _gpgme_user_id;
pub type gpgme_revocation_key_t = *mut _gpgme_revocation_key;
pub type gpgme_key_t = *mut _gpgme_key;
pub type gpgme_invalid_key_t = *mut _gpgme_invalid_key;
pub type gpgme_passphrase_cb_t = ::core::option::Option<
    unsafe extern "C" fn(
        hook: *mut ::core::ffi::c_void,

pub const GPGME_EXPORT_MODE_RAW: u32 = 32;
pub const GPGME_EXPORT_MODE_PKCS12: u32 = 64;
pub const GPGME_EXPORT_MODE_SSH: u32 = 256;
pub const GPGME_EXPORT_MODE_SECRET_SUBKEY: u32 = 512;
pub const GPGME_AUDITLOG_DEFAULT: u32 = 0;
pub const GPGME_AUDITLOG_HTML: u32 = 1;
pub const GPGME_AUDITLOG_DIAG: u32 = 2;
pub const GPGME_AUDITLOG_WITH_HELP: u32 = 128;
pub const GPGME_SIG_NOTATION_HUMAN_READABLE: u32 = 1;
pub const GPGME_SIG_NOTATION_CRITICAL: u32 = 2;
pub const GPGME_INCLUDE_CERTS_DEFAULT: i32 = -256;
pub const GPGME_IMPORT_NEW: u32 = 1;
pub const GPGME_IMPORT_UID: u32 = 2;
pub const GPGME_IMPORT_SIG: u32 = 4;
pub const GPGME_IMPORT_SUBKEY: u32 = 8;
pub const GPGME_IMPORT_SECRET: u32 = 16;
pub const GPGME_CREATE_SIGN: u32 = 1;
pub const GPGME_CREATE_ENCR: u32 = 2;
pub const GPGME_CREATE_CERT: u32 = 4;
pub const GPGME_CREATE_AUTH: u32 = 8;
pub const GPGME_CREATE_NOPASSWD: u32 = 128;
pub const GPGME_CREATE_SELFSIGNED: u32 = 256;
pub const GPGME_CREATE_NOSTORE: u32 = 512;
pub const GPGME_CREATE_WANTPUB: u32 = 1024;
pub const GPGME_CREATE_WANTSEC: u32 = 2048;
pub const GPGME_CREATE_FORCE: u32 = 4096;
pub const GPGME_CREATE_NOEXPIRE: u32 = 8192;
pub const GPGME_CREATE_ADSK: u32 = 16384;
pub const GPGME_DELETE_ALLOW_SECRET: u32 = 1;
pub const GPGME_DELETE_FORCE: u32 = 2;
pub const GPGME_KEYSIGN_LOCAL: u32 = 128;
pub const GPGME_KEYSIGN_LFSEP: u32 = 256;
pub const GPGME_KEYSIGN_NOEXPIRE: u32 = 512;
pub const GPGME_KEYSIGN_FORCE: u32 = 1024;
pub const GPGME_REVSIG_LFSEP: u32 = 256;
pub const GPGME_INTERACT_CARD: u32 = 1;
pub const GPGME_SPAWN_DETACHED: u32 = 1;
pub const GPGME_SPAWN_ALLOW_SET_FG: u32 = 2;
pub const GPGME_SPAWN_SHOW_WINDOW: u32 = 4;
pub const GPGME_CONF_GROUP: u32 = 1;
pub const GPGME_CONF_OPTIONAL: u32 = 2;
pub const GPGME_CONF_LIST: u32 = 4;
pub const GPGME_CONF_RUNTIME: u32 = 8;
pub const GPGME_CONF_DEFAULT: u32 = 16;
pub const GPGME_CONF_DEFAULT_DESC: u32 = 32;
pub const GPGME_CONF_NO_ARG_DESC: u32 = 64;
pub const GPGME_CONF_NO_CHANGE: u32 = 128;
pub const GPGME_EXPORT_MODE_NOUID: u32 = 128;
pub const GPGME_VERIFY_ARCHIVE: gpgme_verify_flags_t = 1;
#[test]
fn bindgen_test_layout__gpgrt__stream__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<_gpgrt__stream__bindgen_ty_1>(),
        4usize,
        "Size of _gpgrt__stream__bindgen_ty_1"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgrt__stream__bindgen_ty_1>(),
        4usize,
        "Alignment of _gpgrt__stream__bindgen_ty_1"
    );
}
#[test]
fn bindgen_test_layout__gpgrt__stream() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgrt__stream> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgrt__stream>(),
        40usize,
        "Size of _gpgrt__stream"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgrt__stream>(),
        4usize,
        "Alignment of _gpgrt__stream"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgrt__stream::flags"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        4usize,
        "Offset of field: _gpgrt__stream::buffer"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buffer_size) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgrt__stream::buffer_size"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_len) as usize - ptr as usize },
        12usize,
        "Offset of field: _gpgrt__stream::data_len"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_offset) as usize - ptr as usize },
        16usize,
        "Offset of field: _gpgrt__stream::data_offset"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_flushed) as usize - ptr as usize },
        20usize,
        "Offset of field: _gpgrt__stream::data_flushed"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).unread_buffer) as usize - ptr as usize },
        24usize,
        "Offset of field: _gpgrt__stream::unread_buffer"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).unread_buffer_size) as usize - ptr as usize },
        28usize,
        "Offset of field: _gpgrt__stream::unread_buffer_size"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).unread_data_len) as usize - ptr as usize },
        32usize,
        "Offset of field: _gpgrt__stream::unread_data_len"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).intern) as usize - ptr as usize },
        36usize,
        "Offset of field: _gpgrt__stream::intern"
    );
}
#[test]
fn bindgen_test_layout__gpgme_sig_notation() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_sig_notation> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_sig_notation>(),
        28usize,
        "Size of _gpgme_sig_notation"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_sig_notation>(),
        4usize,
        "Alignment of _gpgme_sig_notation"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_sig_notation::next"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        4usize,
        "Offset of field: _gpgme_sig_notation::name"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgme_sig_notation::value"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name_len) as usize - ptr as usize },
        12usize,
        "Offset of field: _gpgme_sig_notation::name_len"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_len) as usize - ptr as usize },
        16usize,
        "Offset of field: _gpgme_sig_notation::value_len"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        20usize,
        "Offset of field: _gpgme_sig_notation::flags"
    );
}
#[test]
fn bindgen_test_layout__gpgme_engine_info() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_engine_info> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_engine_info>(),
        24usize,
        "Size of _gpgme_engine_info"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_engine_info>(),
        4usize,
        "Alignment of _gpgme_engine_info"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_engine_info::next"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).protocol) as usize - ptr as usize },
        4usize,
        "Offset of field: _gpgme_engine_info::protocol"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).file_name) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgme_engine_info::file_name"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        12usize,
        "Offset of field: _gpgme_engine_info::version"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).req_version) as usize - ptr as usize },
        16usize,
        "Offset of field: _gpgme_engine_info::req_version"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).home_dir) as usize - ptr as usize },
        20usize,
        "Offset of field: _gpgme_engine_info::home_dir"
    );
}
#[test]
fn bindgen_test_layout__gpgme_tofu_info() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_tofu_info> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_tofu_info>(),
        32usize,
        "Size of _gpgme_tofu_info"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_tofu_info>(),
        4usize,
        "Alignment of _gpgme_tofu_info"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_tofu_info::next"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).signcount) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgme_tofu_info::signcount"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).encrcount) as usize - ptr as usize },
        10usize,
        "Offset of field: _gpgme_tofu_info::encrcount"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).signfirst) as usize - ptr as usize },
        12usize,
        "Offset of field: _gpgme_tofu_info::signfirst"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).signlast) as usize - ptr as usize },
        16usize,
        "Offset of field: _gpgme_tofu_info::signlast"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).encrfirst) as usize - ptr as usize },
        20usize,
        "Offset of field: _gpgme_tofu_info::encrfirst"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).encrlast) as usize - ptr as usize },
        24usize,
        "Offset of field: _gpgme_tofu_info::encrlast"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).description) as usize - ptr as usize },
        28usize,
        "Offset of field: _gpgme_tofu_info::description"
    );
}
#[test]
fn bindgen_test_layout__gpgme_subkey() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_subkey> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_subkey>(),
        68usize,
        "Size of _gpgme_subkey"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_subkey>(),
        4usize,
        "Alignment of _gpgme_subkey"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_subkey::next"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pubkey_algo) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgme_subkey::pubkey_algo"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        12usize,
        "Offset of field: _gpgme_subkey::length"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).keyid) as usize - ptr as usize },
        16usize,
        "Offset of field: _gpgme_subkey::keyid"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._keyid) as usize - ptr as usize },
        20usize,
        "Offset of field: _gpgme_subkey::_keyid"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fpr) as usize - ptr as usize },
        40usize,
        "Offset of field: _gpgme_subkey::fpr"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timestamp) as usize - ptr as usize },
        44usize,
        "Offset of field: _gpgme_subkey::timestamp"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).expires) as usize - ptr as usize },
        48usize,
        "Offset of field: _gpgme_subkey::expires"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).card_number) as usize - ptr as usize },
        52usize,
        "Offset of field: _gpgme_subkey::card_number"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).curve) as usize - ptr as usize },
        56usize,
        "Offset of field: _gpgme_subkey::curve"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).keygrip) as usize - ptr as usize },
        60usize,
        "Offset of field: _gpgme_subkey::keygrip"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v5fpr) as usize - ptr as usize },
        64usize,
        "Offset of field: _gpgme_subkey::v5fpr"
    );
}
#[test]
fn bindgen_test_layout__gpgme_key_sig() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_key_sig> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_key_sig>(),
        84usize,
        "Size of _gpgme_key_sig"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_key_sig>(),
        4usize,
        "Alignment of _gpgme_key_sig"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_key_sig::next"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pubkey_algo) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgme_key_sig::pubkey_algo"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).keyid) as usize - ptr as usize },
        12usize,
        "Offset of field: _gpgme_key_sig::keyid"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._keyid) as usize - ptr as usize },
        16usize,
        "Offset of field: _gpgme_key_sig::_keyid"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timestamp) as usize - ptr as usize },
        36usize,
        "Offset of field: _gpgme_key_sig::timestamp"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).expires) as usize - ptr as usize },
        40usize,
        "Offset of field: _gpgme_key_sig::expires"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        44usize,
        "Offset of field: _gpgme_key_sig::status"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).class) as usize - ptr as usize },
        48usize,
        "Offset of field: _gpgme_key_sig::class"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).uid) as usize - ptr as usize },
        52usize,
        "Offset of field: _gpgme_key_sig::uid"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        56usize,
        "Offset of field: _gpgme_key_sig::name"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).email) as usize - ptr as usize },
        60usize,
        "Offset of field: _gpgme_key_sig::email"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).comment) as usize - ptr as usize },
        64usize,
        "Offset of field: _gpgme_key_sig::comment"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sig_class) as usize - ptr as usize },
        68usize,
        "Offset of field: _gpgme_key_sig::sig_class"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).notations) as usize - ptr as usize },
        72usize,
        "Offset of field: _gpgme_key_sig::notations"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._last_notation) as usize - ptr as usize },
        76usize,
        "Offset of field: _gpgme_key_sig::_last_notation"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).trust_scope) as usize - ptr as usize },
        80usize,
        "Offset of field: _gpgme_key_sig::trust_scope"
    );
}
#[test]
fn bindgen_test_layout__gpgme_user_id() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_user_id> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_user_id>(),
        52usize,
        "Size of _gpgme_user_id"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_user_id>(),
        4usize,
        "Alignment of _gpgme_user_id"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_user_id::next"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).validity) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgme_user_id::validity"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).uid) as usize - ptr as usize },
        12usize,
        "Offset of field: _gpgme_user_id::uid"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        16usize,
        "Offset of field: _gpgme_user_id::name"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).email) as usize - ptr as usize },
        20usize,
        "Offset of field: _gpgme_user_id::email"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).comment) as usize - ptr as usize },
        24usize,
        "Offset of field: _gpgme_user_id::comment"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).signatures) as usize - ptr as usize },
        28usize,
        "Offset of field: _gpgme_user_id::signatures"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._last_keysig) as usize - ptr as usize },
        32usize,
        "Offset of field: _gpgme_user_id::_last_keysig"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        36usize,
        "Offset of field: _gpgme_user_id::address"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tofu) as usize - ptr as usize },
        40usize,
        "Offset of field: _gpgme_user_id::tofu"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).last_update) as usize - ptr as usize },
        44usize,
        "Offset of field: _gpgme_user_id::last_update"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).uidhash) as usize - ptr as usize },
        48usize,
        "Offset of field: _gpgme_user_id::uidhash"
    );
}
#[test]
fn bindgen_test_layout__gpgme_revocation_key() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_revocation_key> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_revocation_key>(),
        20usize,
        "Size of _gpgme_revocation_key"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_revocation_key>(),
        4usize,
        "Alignment of _gpgme_revocation_key"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_revocation_key::next"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pubkey_algo) as usize - ptr as usize },
        4usize,
        "Offset of field: _gpgme_revocation_key::pubkey_algo"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fpr) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgme_revocation_key::fpr"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).key_class) as usize - ptr as usize },
        12usize,
        "Offset of field: _gpgme_revocation_key::key_class"
    );
}
#[test]
fn bindgen_test_layout__gpgme_key() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_key> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_key>(),
        64usize,
        "Size of _gpgme_key"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_key>(),
        4usize,
        "Alignment of _gpgme_key"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._refs) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_key::_refs"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).protocol) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgme_key::protocol"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).issuer_serial) as usize - ptr as usize },
        12usize,
        "Offset of field: _gpgme_key::issuer_serial"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).issuer_name) as usize - ptr as usize },
        16usize,
        "Offset of field: _gpgme_key::issuer_name"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).chain_id) as usize - ptr as usize },
        20usize,
        "Offset of field: _gpgme_key::chain_id"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).owner_trust) as usize - ptr as usize },
        24usize,
        "Offset of field: _gpgme_key::owner_trust"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).subkeys) as usize - ptr as usize },
        28usize,
        "Offset of field: _gpgme_key::subkeys"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).uids) as usize - ptr as usize },
        32usize,
        "Offset of field: _gpgme_key::uids"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._last_subkey) as usize - ptr as usize },
        36usize,
        "Offset of field: _gpgme_key::_last_subkey"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._last_uid) as usize - ptr as usize },
        40usize,
        "Offset of field: _gpgme_key::_last_uid"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).keylist_mode) as usize - ptr as usize },
        44usize,
        "Offset of field: _gpgme_key::keylist_mode"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fpr) as usize - ptr as usize },
        48usize,
        "Offset of field: _gpgme_key::fpr"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).last_update) as usize - ptr as usize },
        52usize,
        "Offset of field: _gpgme_key::last_update"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).revocation_keys) as usize - ptr as usize },
        56usize,
        "Offset of field: _gpgme_key::revocation_keys"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._last_revkey) as usize - ptr as usize },
        60usize,
        "Offset of field: _gpgme_key::_last_revkey"
    );
}
#[test]
fn bindgen_test_layout__gpgme_invalid_key() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_invalid_key> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_invalid_key>(),
        12usize,
        "Size of _gpgme_invalid_key"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_invalid_key>(),
        4usize,
        "Alignment of _gpgme_invalid_key"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_invalid_key::next"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fpr) as usize - ptr as usize },
        4usize,
        "Offset of field: _gpgme_invalid_key::fpr"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reason) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgme_invalid_key::reason"
    );
}
#[test]
fn bindgen_test_layout_gpgme_io_event_done_data() {
    const UNINIT: ::core::mem::MaybeUninit<gpgme_io_event_done_data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<gpgme_io_event_done_data>(),
        8usize,
        "Size of gpgme_io_event_done_data"
    );
    assert_eq!(
        ::core::mem::align_of::<gpgme_io_event_done_data>(),
        4usize,
        "Alignment of gpgme_io_event_done_data"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).err) as usize - ptr as usize },
        0usize,
        "Offset of field: gpgme_io_event_done_data::err"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).op_err) as usize - ptr as usize },
        4usize,
        "Offset of field: gpgme_io_event_done_data::op_err"
    );
}
#[test]
fn bindgen_test_layout_gpgme_io_cbs() {
    const UNINIT: ::core::mem::MaybeUninit<gpgme_io_cbs> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<gpgme_io_cbs>(),
        20usize,
        "Size of gpgme_io_cbs"
    );
    assert_eq!(
        ::core::mem::align_of::<gpgme_io_cbs>(),
        4usize,
        "Alignment of gpgme_io_cbs"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).add) as usize - ptr as usize },
        0usize,
        "Offset of field: gpgme_io_cbs::add"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).add_priv) as usize - ptr as usize },
        4usize,
        "Offset of field: gpgme_io_cbs::add_priv"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).remove) as usize - ptr as usize },
        8usize,
        "Offset of field: gpgme_io_cbs::remove"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event) as usize - ptr as usize },
        12usize,
        "Offset of field: gpgme_io_cbs::event"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_priv) as usize - ptr as usize },
        16usize,
        "Offset of field: gpgme_io_cbs::event_priv"
    );
}
#[test]
fn bindgen_test_layout_gpgme_data_cbs() {
    const UNINIT: ::core::mem::MaybeUninit<gpgme_data_cbs> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<gpgme_data_cbs>(),
        16usize,
        "Size of gpgme_data_cbs"
    );
    assert_eq!(
        ::core::mem::align_of::<gpgme_data_cbs>(),
        4usize,
        "Alignment of gpgme_data_cbs"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).read) as usize - ptr as usize },
        0usize,
        "Offset of field: gpgme_data_cbs::read"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).write) as usize - ptr as usize },
        4usize,
        "Offset of field: gpgme_data_cbs::write"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).seek) as usize - ptr as usize },
        8usize,
        "Offset of field: gpgme_data_cbs::seek"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).release) as usize - ptr as usize },
        12usize,
        "Offset of field: gpgme_data_cbs::release"
    );
}
#[test]
fn bindgen_test_layout__gpgme_op_encrypt_result() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_op_encrypt_result> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_op_encrypt_result>(),
        4usize,
        "Size of _gpgme_op_encrypt_result"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_op_encrypt_result>(),
        4usize,
        "Alignment of _gpgme_op_encrypt_result"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).invalid_recipients) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_op_encrypt_result::invalid_recipients"
    );
}
#[test]
fn bindgen_test_layout__gpgme_recipient() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_recipient> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_recipient>(),
        36usize,
        "Size of _gpgme_recipient"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_recipient>(),
        4usize,
        "Alignment of _gpgme_recipient"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_recipient::next"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).keyid) as usize - ptr as usize },
        4usize,
        "Offset of field: _gpgme_recipient::keyid"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._keyid) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgme_recipient::_keyid"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pubkey_algo) as usize - ptr as usize },
        28usize,
        "Offset of field: _gpgme_recipient::pubkey_algo"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        32usize,
        "Offset of field: _gpgme_recipient::status"
    );
}
#[test]
fn bindgen_test_layout__gpgme_op_decrypt_result() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_op_decrypt_result> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_op_decrypt_result>(),
        24usize,
        "Size of _gpgme_op_decrypt_result"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_op_decrypt_result>(),
        4usize,
        "Alignment of _gpgme_op_decrypt_result"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).unsupported_algorithm) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_op_decrypt_result::unsupported_algorithm"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).recipients) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgme_op_decrypt_result::recipients"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).file_name) as usize - ptr as usize },
        12usize,
        "Offset of field: _gpgme_op_decrypt_result::file_name"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).session_key) as usize - ptr as usize },
        16usize,
        "Offset of field: _gpgme_op_decrypt_result::session_key"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).symkey_algo) as usize - ptr as usize },
        20usize,
        "Offset of field: _gpgme_op_decrypt_result::symkey_algo"
    );
}
#[test]
fn bindgen_test_layout__gpgme_new_signature() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_new_signature> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_new_signature>(),
        36usize,
        "Size of _gpgme_new_signature"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_new_signature>(),
        4usize,
        "Alignment of _gpgme_new_signature"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_new_signature::next"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        4usize,
        "Offset of field: _gpgme_new_signature::type_"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pubkey_algo) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgme_new_signature::pubkey_algo"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hash_algo) as usize - ptr as usize },
        12usize,
        "Offset of field: _gpgme_new_signature::hash_algo"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._obsolete_class) as usize - ptr as usize },
        16usize,
        "Offset of field: _gpgme_new_signature::_obsolete_class"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timestamp) as usize - ptr as usize },
        20usize,
        "Offset of field: _gpgme_new_signature::timestamp"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fpr) as usize - ptr as usize },
        24usize,
        "Offset of field: _gpgme_new_signature::fpr"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).class) as usize - ptr as usize },
        28usize,
        "Offset of field: _gpgme_new_signature::class"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sig_class) as usize - ptr as usize },
        32usize,
        "Offset of field: _gpgme_new_signature::sig_class"
    );
}
#[test]
fn bindgen_test_layout__gpgme_op_sign_result() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_op_sign_result> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_op_sign_result>(),
        8usize,
        "Size of _gpgme_op_sign_result"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_op_sign_result>(),
        4usize,
        "Alignment of _gpgme_op_sign_result"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).invalid_signers) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_op_sign_result::invalid_signers"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).signatures) as usize - ptr as usize },
        4usize,
        "Offset of field: _gpgme_op_sign_result::signatures"
    );
}
#[test]
fn bindgen_test_layout__gpgme_signature() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_signature> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_signature>(),
        56usize,
        "Size of _gpgme_signature"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_signature>(),
        4usize,
        "Alignment of _gpgme_signature"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_signature::next"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).summary) as usize - ptr as usize },
        4usize,
        "Offset of field: _gpgme_signature::summary"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fpr) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgme_signature::fpr"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        12usize,
        "Offset of field: _gpgme_signature::status"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).notations) as usize - ptr as usize },
        16usize,
        "Offset of field: _gpgme_signature::notations"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timestamp) as usize - ptr as usize },
        20usize,
        "Offset of field: _gpgme_signature::timestamp"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).exp_timestamp) as usize - ptr as usize },
        24usize,
        "Offset of field: _gpgme_signature::exp_timestamp"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).validity) as usize - ptr as usize },
        32usize,
        "Offset of field: _gpgme_signature::validity"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).validity_reason) as usize - ptr as usize },
        36usize,
        "Offset of field: _gpgme_signature::validity_reason"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pubkey_algo) as usize - ptr as usize },
        40usize,
        "Offset of field: _gpgme_signature::pubkey_algo"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hash_algo) as usize - ptr as usize },
        44usize,
        "Offset of field: _gpgme_signature::hash_algo"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pka_address) as usize - ptr as usize },
        48usize,
        "Offset of field: _gpgme_signature::pka_address"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        52usize,
        "Offset of field: _gpgme_signature::key"
    );
}
#[test]
fn bindgen_test_layout__gpgme_op_verify_result() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_op_verify_result> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_op_verify_result>(),
        12usize,
        "Size of _gpgme_op_verify_result"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_op_verify_result>(),
        4usize,
        "Alignment of _gpgme_op_verify_result"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).signatures) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_op_verify_result::signatures"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).file_name) as usize - ptr as usize },
        4usize,
        "Offset of field: _gpgme_op_verify_result::file_name"
    );
}
#[test]
fn bindgen_test_layout__gpgme_import_status() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_import_status> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_import_status>(),
        16usize,
        "Size of _gpgme_import_status"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_import_status>(),
        4usize,
        "Alignment of _gpgme_import_status"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_import_status::next"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fpr) as usize - ptr as usize },
        4usize,
        "Offset of field: _gpgme_import_status::fpr"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgme_import_status::result"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        12usize,
        "Offset of field: _gpgme_import_status::status"
    );
}
#[test]
fn bindgen_test_layout__gpgme_op_import_result() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_op_import_result> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_op_import_result>(),
        64usize,
        "Size of _gpgme_op_import_result"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_op_import_result>(),
        4usize,
        "Alignment of _gpgme_op_import_result"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).considered) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_op_import_result::considered"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).no_user_id) as usize - ptr as usize },
        4usize,
        "Offset of field: _gpgme_op_import_result::no_user_id"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).imported) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgme_op_import_result::imported"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).imported_rsa) as usize - ptr as usize },
        12usize,
        "Offset of field: _gpgme_op_import_result::imported_rsa"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).unchanged) as usize - ptr as usize },
        16usize,
        "Offset of field: _gpgme_op_import_result::unchanged"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).new_user_ids) as usize - ptr as usize },
        20usize,
        "Offset of field: _gpgme_op_import_result::new_user_ids"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).new_sub_keys) as usize - ptr as usize },
        24usize,
        "Offset of field: _gpgme_op_import_result::new_sub_keys"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).new_signatures) as usize - ptr as usize },
        28usize,
        "Offset of field: _gpgme_op_import_result::new_signatures"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).new_revocations) as usize - ptr as usize },
        32usize,
        "Offset of field: _gpgme_op_import_result::new_revocations"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).secret_read) as usize - ptr as usize },
        36usize,
        "Offset of field: _gpgme_op_import_result::secret_read"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).secret_imported) as usize - ptr as usize },
        40usize,
        "Offset of field: _gpgme_op_import_result::secret_imported"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).secret_unchanged) as usize - ptr as usize },
        44usize,
        "Offset of field: _gpgme_op_import_result::secret_unchanged"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).skipped_new_keys) as usize - ptr as usize },
        48usize,
        "Offset of field: _gpgme_op_import_result::skipped_new_keys"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).not_imported) as usize - ptr as usize },
        52usize,
        "Offset of field: _gpgme_op_import_result::not_imported"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).imports) as usize - ptr as usize },
        56usize,
        "Offset of field: _gpgme_op_import_result::imports"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).skipped_v3_keys) as usize - ptr as usize },
        60usize,
        "Offset of field: _gpgme_op_import_result::skipped_v3_keys"
    );
}
#[test]
fn bindgen_test_layout__gpgme_op_genkey_result() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_op_genkey_result> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_op_genkey_result>(),
        16usize,
        "Size of _gpgme_op_genkey_result"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_op_genkey_result>(),
        4usize,
        "Alignment of _gpgme_op_genkey_result"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fpr) as usize - ptr as usize },
        4usize,
        "Offset of field: _gpgme_op_genkey_result::fpr"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pubkey) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgme_op_genkey_result::pubkey"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).seckey) as usize - ptr as usize },
        12usize,
        "Offset of field: _gpgme_op_genkey_result::seckey"
    );
}
#[test]
fn bindgen_test_layout__gpgme_op_keylist_result() {
    assert_eq!(
        ::core::mem::size_of::<_gpgme_op_keylist_result>(),
        4usize,
        "Size of _gpgme_op_keylist_result"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_op_keylist_result>(),
        4usize,
        "Alignment of _gpgme_op_keylist_result"
    );
}
#[test]
fn bindgen_test_layout__gpgme_trust_item() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_trust_item> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_trust_item>(),
        56usize,
        "Size of _gpgme_trust_item"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_trust_item>(),
        4usize,
        "Alignment of _gpgme_trust_item"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._refs) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_trust_item::_refs"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).keyid) as usize - ptr as usize },
        4usize,
        "Offset of field: _gpgme_trust_item::keyid"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._keyid) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgme_trust_item::_keyid"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        28usize,
        "Offset of field: _gpgme_trust_item::type_"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).level) as usize - ptr as usize },
        32usize,
        "Offset of field: _gpgme_trust_item::level"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).owner_trust) as usize - ptr as usize },
        36usize,
        "Offset of field: _gpgme_trust_item::owner_trust"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._owner_trust) as usize - ptr as usize },
        40usize,
        "Offset of field: _gpgme_trust_item::_owner_trust"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).validity) as usize - ptr as usize },
        44usize,
        "Offset of field: _gpgme_trust_item::validity"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._validity) as usize - ptr as usize },
        48usize,
        "Offset of field: _gpgme_trust_item::_validity"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        52usize,
        "Offset of field: _gpgme_trust_item::name"
    );
}
#[test]
fn bindgen_test_layout__gpgme_op_vfs_mount_result() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_op_vfs_mount_result> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_op_vfs_mount_result>(),
        4usize,
        "Size of _gpgme_op_vfs_mount_result"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_op_vfs_mount_result>(),
        4usize,
        "Alignment of _gpgme_op_vfs_mount_result"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mount_dir) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_op_vfs_mount_result::mount_dir"
    );
}
#[test]
fn bindgen_test_layout_gpgme_conf_arg__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<gpgme_conf_arg__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<gpgme_conf_arg__bindgen_ty_1>(),
        4usize,
        "Size of gpgme_conf_arg__bindgen_ty_1"
    );
    assert_eq!(
        ::core::mem::align_of::<gpgme_conf_arg__bindgen_ty_1>(),
        4usize,
        "Alignment of gpgme_conf_arg__bindgen_ty_1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        0usize,
        "Offset of field: gpgme_conf_arg__bindgen_ty_1::count"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).uint32) as usize - ptr as usize },
        0usize,
        "Offset of field: gpgme_conf_arg__bindgen_ty_1::uint32"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int32) as usize - ptr as usize },
        0usize,
        "Offset of field: gpgme_conf_arg__bindgen_ty_1::int32"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).string) as usize - ptr as usize },
        0usize,
        "Offset of field: gpgme_conf_arg__bindgen_ty_1::string"
    );
}
#[test]
fn bindgen_test_layout_gpgme_conf_arg() {
    const UNINIT: ::core::mem::MaybeUninit<gpgme_conf_arg> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<gpgme_conf_arg>(),
        12usize,
        "Size of gpgme_conf_arg"
    );
    assert_eq!(
        ::core::mem::align_of::<gpgme_conf_arg>(),
        4usize,
        "Alignment of gpgme_conf_arg"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        "Offset of field: gpgme_conf_arg::next"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).no_arg) as usize - ptr as usize },
        4usize,
        "Offset of field: gpgme_conf_arg::no_arg"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        "Offset of field: gpgme_conf_arg::value"
    );
}
#[test]
fn bindgen_test_layout_gpgme_conf_opt() {
    const UNINIT: ::core::mem::MaybeUninit<gpgme_conf_opt> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<gpgme_conf_opt>(),
        64usize,
        "Size of gpgme_conf_opt"
    );
    assert_eq!(
        ::core::mem::align_of::<gpgme_conf_opt>(),
        4usize,
        "Alignment of gpgme_conf_opt"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        "Offset of field: gpgme_conf_opt::next"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        4usize,
        "Offset of field: gpgme_conf_opt::name"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        8usize,
        "Offset of field: gpgme_conf_opt::flags"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).level) as usize - ptr as usize },
        12usize,
        "Offset of field: gpgme_conf_opt::level"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).description) as usize - ptr as usize },
        16usize,
        "Offset of field: gpgme_conf_opt::description"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        20usize,
        "Offset of field: gpgme_conf_opt::type_"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).alt_type) as usize - ptr as usize },
        24usize,
        "Offset of field: gpgme_conf_opt::alt_type"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).argname) as usize - ptr as usize },
        28usize,
        "Offset of field: gpgme_conf_opt::argname"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).default_value) as usize - ptr as usize },
        32usize,
        "Offset of field: gpgme_conf_opt::default_value"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).default_description) as usize - ptr as usize },
        36usize,
        "Offset of field: gpgme_conf_opt::default_description"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).no_arg_value) as usize - ptr as usize },
        40usize,
        "Offset of field: gpgme_conf_opt::no_arg_value"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).no_arg_description) as usize - ptr as usize },
        44usize,
        "Offset of field: gpgme_conf_opt::no_arg_description"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        48usize,
        "Offset of field: gpgme_conf_opt::value"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).change_value) as usize - ptr as usize },
        52usize,
        "Offset of field: gpgme_conf_opt::change_value"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).new_value) as usize - ptr as usize },
        56usize,
        "Offset of field: gpgme_conf_opt::new_value"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).user_data) as usize - ptr as usize },
        60usize,
        "Offset of field: gpgme_conf_opt::user_data"
    );
}
#[test]
fn bindgen_test_layout_gpgme_conf_comp() {
    const UNINIT: ::core::mem::MaybeUninit<gpgme_conf_comp> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<gpgme_conf_comp>(),
        24usize,
        "Size of gpgme_conf_comp"
    );
    assert_eq!(
        ::core::mem::align_of::<gpgme_conf_comp>(),
        4usize,
        "Alignment of gpgme_conf_comp"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        "Offset of field: gpgme_conf_comp::next"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._last_opt_p) as usize - ptr as usize },
        4usize,
        "Offset of field: gpgme_conf_comp::_last_opt_p"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        "Offset of field: gpgme_conf_comp::name"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).description) as usize - ptr as usize },
        12usize,
        "Offset of field: gpgme_conf_comp::description"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).program_name) as usize - ptr as usize },
        16usize,
        "Offset of field: gpgme_conf_comp::program_name"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).options) as usize - ptr as usize },
        20usize,
        "Offset of field: gpgme_conf_comp::options"
    );
}
#[test]
fn bindgen_test_layout__gpgme_op_query_swdb_result() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_op_query_swdb_result> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_op_query_swdb_result>(),
        32usize,
        "Size of _gpgme_op_query_swdb_result"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_op_query_swdb_result>(),
        4usize,
        "Alignment of _gpgme_op_query_swdb_result"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_op_query_swdb_result::next"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        4usize,
        "Offset of field: _gpgme_op_query_swdb_result::name"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iversion) as usize - ptr as usize },
        8usize,
        "Offset of field: _gpgme_op_query_swdb_result::iversion"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).created) as usize - ptr as usize },
        12usize,
        "Offset of field: _gpgme_op_query_swdb_result::created"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).retrieved) as usize - ptr as usize },
        16usize,
        "Offset of field: _gpgme_op_query_swdb_result::retrieved"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        24usize,
        "Offset of field: _gpgme_op_query_swdb_result::version"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reldate) as usize - ptr as usize },
        28usize,
        "Offset of field: _gpgme_op_query_swdb_result::reldate"
    );
}
#[test]
fn bindgen_test_layout__gpgme_op_assuan_result() {
    const UNINIT: ::core::mem::MaybeUninit<_gpgme_op_assuan_result> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_gpgme_op_assuan_result>(),
        4usize,
        "Size of _gpgme_op_assuan_result"
    );
    assert_eq!(
        ::core::mem::align_of::<_gpgme_op_assuan_result>(),
        4usize,
        "Alignment of _gpgme_op_assuan_result"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).err) as usize - ptr as usize },
        0usize,
        "Offset of field: _gpgme_op_assuan_result::err"
    );
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum gpg_err_source_t {
    GPG_ERR_SOURCE_UNKNOWN = 0,
    GPG_ERR_SOURCE_GCRYPT = 1,
    GPG_ERR_SOURCE_GPG = 2,
    GPG_ERR_SOURCE_GPGSM = 3,
    GPG_ERR_SOURCE_GPGAGENT = 4,
    GPG_ERR_SOURCE_PINENTRY = 5,
    GPG_ERR_SOURCE_SCD = 6,
    GPG_ERR_SOURCE_GPGME = 7,
    GPG_ERR_SOURCE_KEYBOX = 8,
    GPG_ERR_SOURCE_KSBA = 9,
    GPG_ERR_SOURCE_DIRMNGR = 10,
    GPG_ERR_SOURCE_GSTI = 11,
    GPG_ERR_SOURCE_GPA = 12,
    GPG_ERR_SOURCE_KLEO = 13,
    GPG_ERR_SOURCE_G13 = 14,
    GPG_ERR_SOURCE_ASSUAN = 15,
    GPG_ERR_SOURCE_TPM2D = 16,
    GPG_ERR_SOURCE_TLS = 17,
    GPG_ERR_SOURCE_TKD = 18,
    GPG_ERR_SOURCE_ANY = 31,
    GPG_ERR_SOURCE_USER_1 = 32,
    GPG_ERR_SOURCE_USER_2 = 33,
    GPG_ERR_SOURCE_USER_3 = 34,
    GPG_ERR_SOURCE_USER_4 = 35,
    GPG_ERR_SOURCE_DIM = 128,
}
#[repr(u32)]
